; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v1 - type_2 ?v6 - type_3)
 	      (pred_2 ?v7 - object ?v6 - type_3)
	      (pred_3 ?v1 - type_2 ?v8 - type_1)
	      (pred_1 ?v1 - type_2 ?v7 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v1 - type_2 ?v5 ?v2 - type_3)
       :precondition (and  (pred_4 ?v1 ?v5))
       :effect (and  (pred_4 ?v1 ?v2)
		     (not (pred_4 ?v1 ?v5))))

   (:action op_1
       :parameters (?v1 - type_2 ?v3 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v4) (pred_4 ?v1 ?v4) (pred_3 ?v1 ?v8))
       :effect (and (pred_1 ?v1 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v4)) 
		    (not (pred_3 ?v1 ?v8))))

   (:action op_2
       :parameters (?v1 - type_2 ?v3 - object ?v4 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v3 ?v8) (pred_4 ?v1 ?v4))
       :effect (and (pred_2 ?v3 ?v4)
		    (pred_3 ?v1 ?v8)
		    (not (pred_1 ?v1 ?v3 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_2
obj_10 obj_02 - type_1
obj_06 obj_01 obj_04 obj_08 - type_3
obj_09 obj_05 obj_03 - object)
(:init
(pred_4 obj_07 obj_08)
(pred_3 obj_07 obj_10)
(pred_3 obj_07 obj_02)
(pred_2 obj_09 obj_06)
(pred_2 obj_05 obj_06)
(pred_2 obj_03 obj_06)
)
(:goal
(and
(pred_2 obj_09 obj_06)
(pred_2 obj_05 obj_08)
(pred_2 obj_03 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_07 ?b obj_02))))
)
)

; plan
1. (op_3 obj_07 obj_08 obj_06)
   deleted: (pred_4 obj_07 obj_08)
   added: (pred_4 obj_07 obj_06)
   goals met: 2 of 3
2. (op_1 obj_07 obj_05 obj_06 obj_10)
   deleted: (pred_2 obj_05 obj_06) (pred_3 obj_07 obj_10)
   added: (pred_1 obj_07 obj_05 obj_10)
   goals met: 2 of 3
3. (op_3 obj_07 obj_06 obj_08)
   deleted: (pred_4 obj_07 obj_06)
   added: (pred_4 obj_07 obj_08)
   goals met: 2 of 3
4. (op_2 obj_07 obj_05 obj_08 obj_10)
   deleted: (pred_1 obj_07 obj_05 obj_10)
   added: (pred_2 obj_05 obj_08) (pred_3 obj_07 obj_10)
   goals met: 3 of 3
